
import { Router } from 'express';

const router = Router();

router.get('/', (req, res) => {
    res.json({
        status : "success",
        message : `私は同性愛者ではありませんが、大谷翔平さんと一緒に森の中の丸太小屋に住みたいです。私たちはセックスをすることはないでしょう。しかし彼が臀部を引き締めながら木を切るとき、次第に汗ばむ裸の上半身を、キッチンの窓から見ていた私は密かに腰の炎を燃やします。私は階段を上って、自慰行為をするでしょう。私は翔平を頭から追い出そうと、必死に女性の身体を想像しますが、それが無意味なことを知っています。最終的に私は絶頂に達することができないでしょう。そして私は怒りと切なさを感じながら階下に戻ります。 時には私たちはテーブル越しに目を合わせることがあるでしょう。その瞬間、私たちは自分自身の内奥に潜む感情に、喜びを見出す暇もなく蓋をして、そしてそれぞれがしていたことに戻っていくのです。ある日私たちの一人が死に、もう一人が丸太小屋の外に彼を埋めます。それから彼は旅立った友人にちょっとした詩を書いて、そして真のプラトニックな愛なしには生きる理由を見出せずに自殺するでしょう。`
    });
});

router.options('/', (req, res) => {
    res.json({
        status : "success",
        message : `私は同性愛者ではありませんが、大谷翔平さんと一緒に森の中の丸太小屋に住みたいです。私たちはセックスをすることはないでしょう。しかし彼が臀部を引き締めながら木を切るとき、次第に汗ばむ裸の上半身を、キッチンの窓から見ていた私は密かに腰の炎を燃やします。私は階段を上って、自慰行為をするでしょう。私は翔平を頭から追い出そうと、必死に女性の身体を想像しますが、それが無意味なことを知っています。最終的に私は絶頂に達することができないでしょう。そして私は怒りと切なさを感じながら階下に戻ります。 時には私たちはテーブル越しに目を合わせることがあるでしょう。その瞬間、私たちは自分自身の内奥に潜む感情に、喜びを見出す暇もなく蓋をして、そしてそれぞれがしていたことに戻っていくのです。ある日私たちの一人が死に、もう一人が丸太小屋の外に彼を埋めます。それから彼は旅立った友人にちょっとした詩を書いて、そして真のプラトニックな愛なしには生きる理由を見出せずに自殺するでしょう。`
    })
})

router.post('/', (req, res) => {
    res.json({
        status : "success",
        message : `私は同性愛者ではありませんが、大谷翔平さんと一緒に森の中の丸太小屋に住みたいです。私たちはセックスをすることはないでしょう。しかし彼が臀部を引き締めながら木を切るとき、次第に汗ばむ裸の上半身を、キッチンの窓から見ていた私は密かに腰の炎を燃やします。私は階段を上って、自慰行為をするでしょう。私は翔平を頭から追い出そうと、必死に女性の身体を想像しますが、それが無意味なことを知っています。最終的に私は絶頂に達することができないでしょう。そして私は怒りと切なさを感じながら階下に戻ります。 時には私たちはテーブル越しに目を合わせることがあるでしょう。その瞬間、私たちは自分自身の内奥に潜む感情に、喜びを見出す暇もなく蓋をして、そしてそれぞれがしていたことに戻っていくのです。ある日私たちの一人が死に、もう一人が丸太小屋の外に彼を埋めます。それから彼は旅立った友人にちょっとした詩を書いて、そして真のプラトニックな愛なしには生きる理由を見出せずに自殺するでしょう。`
    })
})

router.put('/', (req, res) => {
    res.json({
        status : "success",
        message : `私は同性愛者ではありませんが、大谷翔平さんと一緒に森の中の丸太小屋に住みたいです。私たちはセックスをすることはないでしょう。しかし彼が臀部を引き締めながら木を切るとき、次第に汗ばむ裸の上半身を、キッチンの窓から見ていた私は密かに腰の炎を燃やします。私は階段を上って、自慰行為をするでしょう。私は翔平を頭から追い出そうと、必死に女性の身体を想像しますが、それが無意味なことを知っています。最終的に私は絶頂に達することができないでしょう。そして私は怒りと切なさを感じながら階下に戻ります。 時には私たちはテーブル越しに目を合わせることがあるでしょう。その瞬間、私たちは自分自身の内奥に潜む感情に、喜びを見出す暇もなく蓋をして、そしてそれぞれがしていたことに戻っていくのです。ある日私たちの一人が死に、もう一人が丸太小屋の外に彼を埋めます。それから彼は旅立った友人にちょっとした詩を書いて、そして真のプラトニックな愛なしには生きる理由を見出せずに自殺するでしょう。`
    })
})

router.patch('/', (req, res) => {
    res.json({
        status : "success",
        message : `私は同性愛者ではありませんが、大谷翔平さんと一緒に森の中の丸太小屋に住みたいです。私たちはセックスをすることはないでしょう。しかし彼が臀部を引き締めながら木を切るとき、次第に汗ばむ裸の上半身を、キッチンの窓から見ていた私は密かに腰の炎を燃やします。私は階段を上って、自慰行為をするでしょう。私は翔平を頭から追い出そうと、必死に女性の身体を想像しますが、それが無意味なことを知っています。最終的に私は絶頂に達することができないでしょう。そして私は怒りと切なさを感じながら階下に戻ります。 時には私たちはテーブル越しに目を合わせることがあるでしょう。その瞬間、私たちは自分自身の内奥に潜む感情に、喜びを見出す暇もなく蓋をして、そしてそれぞれがしていたことに戻っていくのです。ある日私たちの一人が死に、もう一人が丸太小屋の外に彼を埋めます。それから彼は旅立った友人にちょっとした詩を書いて、そして真のプラトニックな愛なしには生きる理由を見出せずに自殺するでしょう。`
    })
})

router.delete('/', (req, res) => {
    res.json({
        status : "success",
        message : `私は同性愛者ではありませんが、大谷翔平さんと一緒に森の中の丸太小屋に住みたいです。私たちはセックスをすることはないでしょう。しかし彼が臀部を引き締めながら木を切るとき、次第に汗ばむ裸の上半身を、キッチンの窓から見ていた私は密かに腰の炎を燃やします。私は階段を上って、自慰行為をするでしょう。私は翔平を頭から追い出そうと、必死に女性の身体を想像しますが、それが無意味なことを知っています。最終的に私は絶頂に達することができないでしょう。そして私は怒りと切なさを感じながら階下に戻ります。 時には私たちはテーブル越しに目を合わせることがあるでしょう。その瞬間、私たちは自分自身の内奥に潜む感情に、喜びを見出す暇もなく蓋をして、そしてそれぞれがしていたことに戻っていくのです。ある日私たちの一人が死に、もう一人が丸太小屋の外に彼を埋めます。それから彼は旅立った友人にちょっとした詩を書いて、そして真のプラトニックな愛なしには生きる理由を見出せずに自殺するでしょう。`
    })
})

export default router;